       IDENTIFICATION DIVISION.
       PROGRAM-ID. ANIO-BISIESTO.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.

       01 VAR_ANIO PIC 9(4).
       01 RESTO_4 PIC 9(4).
       01 RESTO_100 PIC 9(4).
       01 RESTO_400 PIC 9(4).
       01 RESULTADO PIC 9(4).

       PROCEDURE DIVISION.

       PERFORM ACCEPT-ANIO.
       PERFORM CALCULOS.
       PERFORM VEO-BISIESTO.


       ACCEPT-ANIO.
            DISPLAY "INTRODUZCA UN AÑO: "
            ACCEPT VAR_ANIO.
       FIN-ACCEPT.

       CALCULOS.
           DIVIDE VAR_ANIO BY 4 GIVING RESULTADO REMAINDER RESTO_4.
           DIVIDE VAR_ANIO BY 100 GIVING RESULTADO REMAINDER RESTO_100.
           DIVIDE VAR_ANIO BY 400 GIVING RESULTADO REMAINDER RESTO_400.
       END-CALCULOS.

       VEO-BISIESTO.
           IF (RESTO_400 = 0) THEN
               DISPLAY "EL AÑO " VAR_ANIO "ES BISIESTO"
           ELSE
               IF (RESTO_4 = 0 AND RESTO_100 NOT = 0) THEN
                   DISPLAY "EL AÑO " VAR_ANIO "ES BISIESTO"
               ELSE
                   DISPLAY "EL AÑO" VAR_ANIO "NO ES BISISESTO"
               END-IF
           END-IF.
       END PROGRAM ANIO-BISIESTO.
