       IDENTIFICATION DIVISION.
       PROGRAM-ID. CONSULTAR-PRODUCTO.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PRODUCTO
               ASSIGN TO "producto.dat"
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS PRODUCTO-ID
               FILE STATUS IS FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD PRODUCTO.
       01 PRODUCTO-REGISTRO.
               05 PRODUCTO-ID PIC 9(6).
               05 PRODUCTO-NOMBRE PIC X(30).
               05 PRODUCTO-PRECIO PIC 9(5)V99.
               05 PRODUCTO-STOCK PIC 9(6).
               05 PRODUCTO-CADUCIDAD PIC 9(8).

       WORKING-STORAGE SECTION.
       01 OPCION PIC 9 VALUE 0.
       01 FILE-STATUS PIC XX VALUE "00".
       01 FIN PIC X VALUE "N".
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
          CONSULTAR-PRODUCTO.
           DISPLAY "INGRESE EL ID DEL PRODUCTO"
           ACCEPT PRODUCTO-ID.
           READ PRODUCTO
               INVALID KEY
               DISPLAY "PRODUCTO NO ENCONTRADO"
               NOT INVALID KEY
               DISPLAY "NOMBRE: " PRODUCTO-NOMBRE
               DISPLAY "PRECIO: " PRODUCTO-PRECIO
               DISPLAY "STOCK: "  PRODUCTO-STOCK
               DISPLAY "CADUCIDAD: " PRODUCTO-CADUCIDAD
           END-READ.
            STOP RUN.
       END PROGRAM CONSULTAR-PRODUCTO.
