       IDENTIFICATION DIVISION.
       PROGRAM-ID. DATOS-ARRAY.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       01 N PIC 9.
       01 TABLA.
           02 VALOR PIC 9 OCCURS 100 TIMES.
       01 TAM PIC 9.
       01 I PIC 9 VALUE 0.
       01 J PIC 9 VALUE 0.


       01 AUX PIC 9 VALUE 0.
       01 I-MAS-UNO PIC 9 VALUE 0.


       PROCEDURE DIVISION.

            DISPLAY "INSERTE UN NUMERO DE CELDAS ADIMENSIONAR : ".
            ACCEPT TAM.


       PERFORM VARYING I FROM 1 BY 1 UNTIL I > TAM
           DISPLAY "INGRESE EL NUM PARA LA CELDA" I ":"
           ACCEPT N
           MOVE N TO VALOR (I)

       END-PERFORM.

      *ORDENAR USANDO ARRAY
       PERFORM VARYING I FROM 1 BY 1 UNTIL I > TAM - 1
           COMPUTE I-MAS-UNO = I + 1
           PERFORM VARYING J FROM I-MAS-UNO BY 1 UNTIL J > TAM
           IF VALOR (I) > VALOR (J)
               MOVE VALOR(I) TO AUX
               MOVE VALOR (J) TO VALOR (I)
               MOVE AUX TO VALOR (J)
           END-IF
           END-PERFORM
       END-PERFORM.

       DISPLAY "EL ARRAY ORDENADO ES: "
       PERFORM VARYING I FROM 1 BY 1 UNTIL I > TAM
       DISPLAY VALOR(I)
       END-PERFORM.

       STOP RUN.
       END PROGRAM DATOS-ARRAY.
