       IDENTIFICATION DIVISION.
       PROGRAM-ID. DigitoC.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.

       DATA DIVISION.

       WORKING-STORAGE SECTION.
       01 CHAR-TABLA.
               05 CHAR-ENTRADA PIC 9 OCCURS 100 TIMES.
       77 I     PIC 99 VALUE 0.
       01 NUM1 PIC 9(10).
       01 RESULTADO PIC 9(01).
       01 RESTO PIC 9(02).
       01 DIGITO-CONTROL PIC 9.

       LINKAGE SECTION.
       01 PRODUCTO PIC 9(6).
       01 DIGITO PIC 9.

       PROCEDURE DIVISION USING PRODUCTO, DIGITO.

           MOVE 0 TO DIGITO.
           MOVE 0 TO NUM1.
           DISPLAY "DATOS RECIBIDOS EN DC: " PRODUCTO " " DIGITO.
           MOVE PRODUCTO TO CHAR-TABLA.

           PERFORM VARYING I FROM 1 BY 1 UNTIL CHAR-ENTRADA(I) = SPACE
               COMPUTE NUM1 = NUM1 + CHAR-ENTRADA(I)
           END-PERFORM

           DIVIDE  NUM1 BY 10 GIVING RESULTADO REMAINDER RESTO
           COMPUTE DIGITO-CONTROL = 10 - RESTO
           MOVE DIGITO-CONTROL TO DIGITO
           DISPLAY "DATOS A ENVIAR DESDE DC: " PRODUCTO " " DIGITO.
       END PROGRAM DigitoC.
