      ******************************************************************
      * Author:LAURA BELTRÁN PULIDO
      * Date: 25/10/2024 17:48
      * Purpose: ENSEÑAR PROGRAMA BASICO
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
      *LA ETIQUETA PROGRAM-ID DEBE ABRIR Y CERRA (END-PROGRAM)
      *CON EL MISMO NOMBRE Y ES COMO IDENTIFICAMOS EL PROGRAMA
       PROGRAM-ID. EXPLICACION-ESTRUCTURA.
       ENVIRONMENT DIVISION.
      *DEFINIR Y EJECUTAR EL ENTORNO EN EL QUE SE EJECUTA EL PROGRAMA
       CONFIGURATION SECTION.
      *ESPECIFICAR INFORMACIÓN SOBRE EL ENTORNO
           SPECIAL-NAMES.
               DECIMAL-POINT IS COMMA.
       INPUT-OUTPUT SECTION.
      *ENTRADA Y SALIDA DEL PROGRAMA
           FILE-CONTROL.
      *ASIGNAR NOMBRES LOGICOS DE ARCHIVOS UTILIZADOS EN EL PROGRAMA
      *A NOMBRE FISICOS EN EL SISTEMA.



       DATA DIVISION.
       FILE SECTION.
      *ARCHIVOS QUE EL PROGRAMA LEERA O ESCRIBIRÁ.
      *REGISTROS PARA ENTRADA Y SALIDA DE DATOS DE ARCHIVO EXTERNOS.
       WORKING-STORAGE SECTION.
      *DEFINE VARIABLES Y ESTRUCTURAS EN LA MEMORIA DEL PROGRAMA
      *DURANTE LA EJECUCION
      *VARIABLES TEMPORALES, CONTADORES Y BANDERAS
       LINKAGE SECTION.
      *DEFINE DATOS QUE SERÁN COKMPARTIDOS ENTRE PROGRAMAS
      *MANEJAR PARAMETROS QUE SE PASAN ENTRE DIFERENTES MODULOS DE
      *DE PROGRAMAS

       PROCEDURE DIVISION.
      *-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
       MAIN-PROCEDURE.
      **
      * The main procedure of the program
      **
            DISPLAY "Hello world"
            STOP RUN.
      ** add other procedures here
       END PROGRAM EXPLICACION-ESTRUCTURA.
