       IDENTIFICATION DIVISION.
       PROGRAM-ID. MODIFICAR-PRODUCTO.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PRODUCTO
               ASSIGN TO "PRODUCTO-INDEXADO.dat"
               ORGANIZATION IS INDEXED
               RECORD KEY PRODUCTO-ID
               ACCESS MODE IS DYNAMIC
               FILE STATUS IS FILE-STATUS.
       DATA DIVISION.
       FILE SECTION.
       FD PRODUCTO.
       01 PRODUCTO-REGISTRO.
               03 PRODUCTO-ID PIC 9(6).
               03 PRODUCTO-CONTROL PIC 9.
               03 PRODUCTO-DESCRIP PIC X(35).
               03 PRODUCTO-PRECIO PIC 9(4)V99.
               03 PRODUCTO-STOCK PIC 9(6).
               03 PRODUCTO-CADUCIDAD.
                   05 PRODUCTO-CAD-AAAA PIC 9(4).
                   05 PRODUCTO-CAD-MM PIC 99.
                   05 PRODUCTO-CAD-DD PIC 99.
               03 PRODUCTO-CRITICO PIC 9(6).
               03 PRODUCTO-ALTA-FECH.
                   05 PRODUCTO-ALTA-AAAA PIC 9(4).
                   05 PRODUCTO-ALTA-MM PIC 99.
                   05 PRODUCTO-ALTA-DD PIC 99.

       WORKING-STORAGE SECTION.

       01 File-Status PIC XX VALUE SPACES.
       01 NUEVO-REGISTRO-PRODUCTO.
           03 NUEVO-PRODUCTO-ID PIC 9(6).
           03 NUEVO-PRODUCTO-CONTROL PIC 9.
           03 NUEVO-PRODUCTO-DESCRIP PIC X(35).
           03 NUEVO-PRODUCTO-PRECIO PIC 9(4)V99.
           03 NUEVO-PRODUCTO-STOCK PIC 9(6).
           03 NUEVO-PRODUCTO-CADUCIDAD.
               05 NUEVO-PRODUCTO-CAD-AAAA PIC 9(4).
               05 NUEVO-PRODUCTO-CAD-MM PIC 99.
               05 NUEVO-PRODUCTO-CAD-DD PIC 99.
           03 NUEVO-PRODUCTO-CRITICO PIC 9(6).
           03 NUEVO-PRODUCTO-ALTA-FECH.
               05 NUEVO-PRODUCTO-ALTA-AAAA PIC 9(4).
               05 NUEVO-PRODUCTO-ALTA-MM PIC 99.
               05 NUEVO-PRODUCTO-ALTA-DD PIC 99.
       01 FECHA-EDITADA PIC 9999/99/99.
       01 CONTINUE-PROG PIC X VALUE "S".
       01 OPCION-MODIFICAR PIC 99.
       PROCEDURE DIVISION.

       OPEN I-O PRODUCTO.
       IF FILE-STATUS = "35"
        DISPLAY "El archivo no existe. Se procede a crearlo."
        OPEN OUTPUT PRODUCTO
        CLOSE PRODUCTO
      * Reintentar abrir en modo I-O
        OPEN I-O PRODUCTO
       END-IF

      * Verificar si el archivo se abrió correctamente
       IF FILE-STATUS NOT = "00"
        DISPLAY "Error al abrir el archivo. Codigo de estado: "
        FILE-STATUS
        CLOSE PRODUCTO
        STOP RUN
       END-IF

       PERFORM UNTIL CONTINUE-PROG = "N"

       DISPLAY "Ingrese el ID del producto: "
        ACCEPT PRODUCTO-ID

        READ PRODUCTO
        INVALID KEY
        DISPLAY "PRODUCTO NO ENCONTRADO. CERRANDO PROGRAMA"
        MOVE "N" TO CONTINUE-PROG
        NOT INVALID KEY
        DISPLAY "PRODUCTO ENCONTRADO: "
        DISPLAY "ID: " PRODUCTO-ID
        DISPLAY "1. DESCRIPCION: " PRODUCTO-DESCRIP
        DISPLAY "2. PRECIO: " PRODUCTO-PRECIO
        DISPLAY "3. STOCK: " PRODUCTO-STOCK
        DISPLAY "4. CADUCIDAD ANIO: " PRODUCTO-CAD-AAAA
        DISPLAY "5. CADUCIDAD MES: " PRODUCTO-CAD-MM
        DISPLAY "6. CADUCIDAD DIA: " PRODUCTO-CAD-DD
        DISPLAY "2. CRITICO: " PRODUCTO-CRITICO
        DISPLAY "4. ALTA ANIO: " PRODUCTO-ALTA-AAAA
        DISPLAY "5. ALTA MES: " PRODUCTO-ALTA-MM
        DISPLAY "6. ALTA DIA: " PRODUCTO-ALTA-DD

        DISPLAY "¿QUE DESEA MODIFICAR? SELECCIONE EL NUMERO:"
        ACCEPT OPCION-MODIFICAR

        EVALUATE OPCION-MODIFICAR
        WHEN 1
           DISPLAY "INGRESE LA NUEVA DESCRIPCION: "
           ACCEPT NUEVO-PRODUCTO-DESCRIP
           MOVE NUEVO-PRODUCTO-DESCRIP TO PRODUCTO-DESCRIP
        WHEN 2
           DISPLAY "INGRESE EL NUEVO PRECIO: "
           ACCEPT NUEVO-PRODUCTO-DESCRIP
           MOVE NUEVO-PRODUCTO-PRECIO TO PRODUCTO-PRECIO
       WHEN 3
           DISPLAY "INGRESE EL NUEVO STOCK: "
           ACCEPT NUEVO-PRODUCTO-STOCK
           MOVE NUEVO-PRODUCTO-STOCK TO PRODUCTO-STOCK
       WHEN 4
           DISPLAY "INGRESE NUEVA CADUCIDAD ANIO: "
           ACCEPT NUEVO-PRODUCTO-CAD-AAAA
           MOVE NUEVO-PRODUCTO-CAD-AAAA TO PRODUCTO-CAD-AAAA
       WHEN 5
           DISPLAY "INGRESE NUEVA CADUCIDAD MES: "
           ACCEPT NUEVO-PRODUCTO-CAD-MM
           MOVE NUEVO-PRODUCTO-CAD-MM TO PRODUCTO-CAD-MM
       WHEN 6
           DISPLAY "INGRESE NUEVA CADUCIDAD DIA: "
           ACCEPT NUEVO-PRODUCTO-CAD-DD
           MOVE NUEVO-PRODUCTO-CAD-DD TO PRODUCTO-CAD-DD

       WHEN 7
           DISPLAY "INGRESE NUEVO CRITICO PRODUCTO: "
           ACCEPT NUEVO-PRODUCTO-CRITICO
           MOVE NUEVO-PRODUCTO-CRITICO TO PRODUCTO-CRITICO
       WHEN 8
       DISPLAY "INGRESE NUEVA ALTA ANIO: "
           ACCEPT NUEVO-PRODUCTO-ALTA-AAAA
           MOVE NUEVO-PRODUCTO-ALTA-AAAA TO PRODUCTO-ALTA-AAAA
       WHEN 9
           DISPLAY "INGRESE NUEVA ALTA MES: "
           ACCEPT NUEVO-PRODUCTO-ALTA-MM
           MOVE NUEVO-PRODUCTO-ALTA-MM TO PRODUCTO-ALTA-MM
       WHEN 10
           DISPLAY "INGRESE NUEVA ALTA DIA: "
           ACCEPT NUEVO-PRODUCTO-ALTA-DD
           MOVE NUEVO-PRODUCTO-ALTA-DD TO PRODUCTO-ALTA-DD

       WHEN OTHER
           DISPLAY "NUMERO INTRODUCIDO NO VALIDO : "
           MOVE "N" TO CONTINUE-PROG
       END-EVALUATE
       REWRITE PRODUCTO-REGISTRO

       DISPLAY "¿DESEA REALIZAR OTRA MODIFICACION? S/N"
       ACCEPT CONTINUE-PROG

       END-READ
       END-PERFORM.



       END PROGRAM MODIFICAR-PRODUCTO.
